#+TITLE: Аутентификация пользователей CentOS 5/6 с использованием OpenLDAP 2.3/2.4
#+OPTIONS: toc:4 H:6 num:t html-postamble:nil ^:nil tags:nil author:nil
#+SETUPFILE: theme-readtheorg-local.setup
#+HTML_HEAD: <style type="text/css">.org-src-name{ text-align: right; }</style>
#+HTML_HEAD: <style type="text/css">.outline-2{ margin-top: 60px; }</style>
#+MACRO: fa @@html:&nbsp;<sup><i class="fa fa-$1"></i></sup>@@
# #+BIBLIOGRAPHY: /home/eab/git/lit/ldap.bib plain option:-d
# #+HTML_HEAD: <style type="text/css">#content{ text-align: justify; }</style>
# #+HTML_HEAD: <style type="text/css">#content{ -moz-hyphens: auto;-webkit-hyphens: auto;-ms-hyphens: auto; }</style>

* Схема каталога LDAP
:PROPERTIES:
:CUSTOM_ID: schema
:ID:       b64d7c36-b2b3-49ac-9620-d7c94eb9ea31
:END:
#+begin_quote
Необходимо разработать схему каталога LDAP, предназначенную для хранения учетных данных пользователей кластера.
#+end_quote

Использование только *ldif* формата позволяет единообразно
конфигурировать схему каталога LDAP, начиная с корневой записи DIT
(Directory Information Tree) *cn=config*, включающей точку ветвления
*cn=schema,cn=config*, которая содержит наборы схем данных
(см. подраздел [[#configure-slapd]]), переходя к корневой записи домена
(см. подраздел [[#root-domain]]) и заканчивая листьями этого дерева
(см. подразделы [[#new-user-ldap]], [[#add-users]]) --- записями, содержащими
нужную информацию:
#+begin_src sh :exports results :results raw
grep -i -h -e  "^#+caption.*\\.ldif" index.org | sed "s/#+caption://g" | sed "s/:/|/g" | sed "s/^/|/"
#+end_src

#+RESULTS:
| *slapd.ldif*   | формирование корневой записи DIT и контейнера для наборов схем данных; конфигурирование базы данных *HDB* и подключение мониторинга баз данных       |
| *front.ldif*   | добавление служебной базы данных *frontend* (только для *5/2.3*)                                                                                     |
| *domain.ldif*  | связывание суффикса, менеджера домена и его пароля с базой *HDB*; установка списка контроля доступа ACL                                              |
| *base.ldif*    | создание суффикса, менеджера домена, организационных единиц и учетной записи *authenticator*                                                         |
| *sudoers.ldif* | создание организационной единицы *sudoers*, добавление настроек по умолчанию для *sudo* и группы *sudowheel*, включенной в группу администраторов *sudo* |
| *user.ldif*    | создание нового пользователя, принадлежащего к группе *sudowheel*                                                                                        |
| *mercury.ldif* | пример результата миграции пользователей и групп с помощью утилит *migrationtools*                                                                   |

Если же используется *conf* формат, то надо иметь в виду, что
первый файл из этого ряда конфигурационных файлов
заменяется на *slapd.conf* (см. раздел [[#configure-slapd-conf]]).

#+begin_note
В данном руководстве слово "схема" используется в выражении /набор
схем данных/ (см. подраздел [[#add-schemas]]), означающим файл с
расширением *schema* или *ldif*, содержащий "низкоуровневое" описание
классов, атрибутов, синтаксисов атрибута и правил соответствия. Также,
оно используется в выражении /схема каталога LDAP/, т.е. для
"высокоуровнего" описания содержания, структуры и ограничений
целостности каталога LDAP, по аналогии с выражением /схема базы
данных/, применимым для реляционных баз данных. Возможности схемы
каталога LDAP определяются подключенными наборами схем данных. Можно
сказать, что /схема каталога LDAP/ --- это полное описание каталога
LDAP с помощью *ldif* формата. При этом, граница между схемой каталога
и пользовательскими данными, которые также хранятся в *ldif* формате,
становится условной. Кроме того, каталог LDAP использует /базу данных
*HDB*/ в качестве хранилища данных.
#+end_note

В таблице [[tab:schema-examples]] приведены примеры использования классов
и атрибутов схемы каталога LDAP. В данном разделе осуществляется
"высокоуровневая" разработка схемы каталога LDAP в *ldif* формате,
предназначенная для хранения учетных данных пользователей
кластера. Подключаются только указанные наборы схем данных,
разрабатывать дополнительные "низкоуровневые" наборы схем данных нет
необходимости.

#+name: tab:schema-examples
#+caption: Примеры наборов схем данных, классов, атрибутов и их использования
| Набор схем данных    | Классы                        | Атрибуты                 | Примеры использования               |
|----------------------+-------------------------------+--------------------------+-------------------------------------|
| openldap hardcoded   | top, olcDatabaseConfig        | uid, cn, olcSchemaDN     | slapd.ldif, domain.ldif, front.ldif |
| core.schema          | dcObject, organizationalRole  | dc, sn                   | base.ldif                           |
| cosine.schema        | simpleSecurityObject, account | userPassword             | base.ldif                           |
| inetorgperson.schema | inetOrgPerson                 | employeeNumber           |                                     |
| nis.schema           | posixAccount, posixGroup      | homeDirectory, gidNumber | user.ldif, mercury.ldif             |
| sudo.schema          | sudoRole                      | sudoUser                 | sudoers.ldif                        |
| misc.schema          | inetLocalMailRecipient        | mailRoutingAddress       | user.ldif                           |
| ppolicy.schema       | pwdPolicy                     | pwdAttribute             | base.ldif                           |



** Стандартные команды администрирования пользователей в случае использования LDAP
:PROPERTIES:
:CUSTOM_ID: standard-commands
:ID:       84d40fcf-c285-40e6-9f13-11685889a085
:END:

#+begin_verse
Где работаем: любой хост в локальной сети контейнеров с установленными утилитами openldap-client
#+end_verse

В подразделе [[#hdb-domain-config]]
устанавливаются разрешения для полей *userPassword* и
*shadowLastChange*, чтобы пользователь имел право на смену пароля.

#+begin_src sh :exports none :results code sh
sed -n "/^function password() {/,/^}/p" ../schema/schema.sh | sed '1d' | sed '$d' | sed '$d'
#+end_src

#+caption: Изменение пользователем своего пароля с помощью утилиты *ldappasswd*
#+BEGIN_SRC sh
    ldappasswd -h $1 -x -D "uid=username,ou=users,dc=mercury,dc=febras,dc=net" -w p@ssw0rd -s new_p@ssw0rd
#+END_SRC

#+begin_warning
При использовании утилиты *ldappasswd* изменения атрибута
*shadowLastChange* не происходит. Его необходимо задавать отдельно с
помощью утилиты *ldapmodify*. В случае применения утилиты *passwd*,
атрибут *shadowLastChange* корректно обновляется в LDAP (благодаря
действиям PAM) при наличии соответствующих прав доступа на запись.
#+end_warning

#+begin_src sh :exports results :results code sh
sed -n "/^function modify() {/,/^}/p" ../schema/schema.sh | sed '1d' | sed '$d'
#+end_src

#+caption: Изменение менеджером домена значения *loginShell* с помощью утилиты *ldapmodify*
#+RESULTS:
#+BEGIN_SRC sh
    ldapmodify -h $1 -x -D "cn=Manager,dc=mercury,dc=febras,dc=net" -w manager <<EOF
dn: uid=username,ou=users,dc=mercury,dc=febras,dc=net
changetype: modify
replace: loginShell
loginShell: /bin/sh
-
EOF
    ldapsearch -x -h $1 -LLL -D 'cn=Manager,dc=mercury,dc=febras,dc=net' -b 'uid=username,ou=users,dc=mercury,dc=febras,dc=net' '(loginShell=*)' -w manager | grep loginShell
#+END_SRC

Значение *loginShell: /bin/bash*, указанное в файле *user.ldif*, изменилось на */bin/sh*:

#+begin_src sh :exports results :results value pp
sed -n "/^function modify_out() {/,/^}/p" ../schema/schema.sh | sed '1d' | sed '$d' | sed '1d' | sed '$d'
#+end_src

#+RESULTS:
: modifying entry "uid=username,ou=users,dc=mercury,dc=febras,dc=net"
: 
: loginShell: /bin/sh

#+caption: Замещение стандартных команд в случае использования LDAP
| Утилита         | Работает с LDAP | Примечание                                                                    |
|-----------------+-----------------+-------------------------------------------------------------------------------|
| *passwd*        | *Да*            |                                                                               |
| *useradd*       | Нет             | *luseradd* или *ldapadd*, атрибуты классов *posixAccount*, *shadowAccount*    |
| *usermod*       | Нет             | *lusermod* или *ldapmodify*, атрибуты классов *posixAccount*, *shadowAccount* |
| *groupadd*      | Нет             | *lgroupadd* или *ldapadd*, атрибуты класса *posixGroup*                       |
| *groupmod*      | Нет             | *lgroupmod* или *ldapmodify*, атрибуты класса *posixGroup*                    |
| *finger*        | *Да*            |                                                                               |
| *chsh*          | Нет             | *ldapmodify*, атрибут *loginShell*                                            |
| *chfn*          | Нет             | *ldapmodify*, атрибут *gecos*                                                 |
| файл *.forward* | Нет             | атрибут *mailRoutingAddress* класса *inetLocalMailRecipient*                  |

#+begin_tip
Утилиты *luseradd*, *lusermod*, *lgroupadd* и *lgroupmod* принадлежат
библиотеке *libuser*, а утилиты *ldapadd* и *ldapmodify* содержатся в
пакете *openldap-clients*.
#+end_tip

#+begin_note
В файле */etc/nsswitch.conf* указывается порядок обращения к базам
данных (слева направо): *files* *ldap*. Если использовать команду
/passwd username/, вызываемую от имени суперпользователя, то поиск
пользователя *username* будет осуществляться сначала в базе *files* и,
если он там присутствует, произойдет смена пароля. До базы *ldap* в
этом случае поиск не дойдет, даже в случае наличия в ней пользователя
*username*. Однако, если войти в систему под учетной записью
*username*, используя пароль из базы *ldap*, и использовать команду
/passwd/ (т.е. смену пароля для текущего пользователя), то произойдет
смена пароля в базе *ldap*, а база *files* останется без изменений.
#+end_note

